In [5]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [3]:
v = Series([-1, 1, 200, 191, 4])

In [ ]:
v < 0
0  True
1  False
2  False
3  False
4  False

In [ ]:
v * v == 1
0  True
1  True
2  False
3  False
4  False

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v[v > 100]
False
False
True
True
False

0  -1
1  1
2  200
3  191
4  4

Final Answer
2  200
3  191

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v[v % 2 == 0]
0   -1 % 2  = 1     False
1   1 % 2 = 1       False
2   200 % 2 = 0     True
3   191 % 2 = 1     False
4   4 % 2 = 0       True

Final Answer
2  200
4  4

In [ ]:
v = Series([-1, 1, 200, 191, 4])
v[(v>0) & (v<100)]
False      True          False
True       True          True
True       False         False
True       False         False
True       True          True

Final Answer
1  1
4  4

In [28]:
import pandas as pd
from pandas import Series, DataFrame

In [30]:
x = Series({"A":10, "B":100})
s1 = Series({"A":2, "B":3})
s2 = Series({"B":3, "A":2})
print(x)
print(s1)
print(s2)

A     10
B    100
dtype: int64
A    2
B    3
dtype: int64
B    3
A    2
dtype: int64

In [31]:
x * s1

A     20
B    300
dtype: int64

In [32]:
x*s2

A     20
B    300
dtype: int64

In [33]:
x<s1

A    False
B    False
dtype: bool

In [35]:
# x<s2 #ValueError

In [36]:
x.lt(s2) # lt is less than

A    False
B    False
dtype: bool

In [37]:
x.gt(s2) # greater than
x.eq(s2) # equal
x.ge(s2) # greater than or equal
x.le(s2) # less than or equal
x.ne(s2) # not equal

s2_sorted = s2.sort_index()

A    2
B    3
dtype: int64

In [49]:
col1 = Series(["Alice", "Bob", "Cindy", "Dan"])
col2 = Series([6, 7, 8, 9])
DataFrame({
    "Names": col1,
    "Scores": col2
})

   Names  Scores
0  Alice       6
1    Bob       7
2  Cindy       8
3    Dan       9

In [50]:
#dictionary of lists
DataFrame({
    "Names": ["Alice", "Bob", "Cindy", "Dan"],
    "Scores": [6, 7, 8, 9]
})

   Names  Scores
0  Alice       6
1    Bob       7
2  Cindy       8
3    Dan       9

In [51]:
#list of lists
DataFrame([
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
])

       0  1
0  Alice  6
1    Bob  7
2  Cindy  8
3    Dan  9

In [58]:
#dict of dict
DataFrame({
    "Name":{"A":"Alice", "B":"Bob", "C":"Cindy", "D":"Dan"},
    "Score":{"A":6, "B":8, "C":8, "D":9}
})

    Name  Score
A  Alice      6
B    Bob      8
C  Cindy      8
D    Dan      9

In [60]:
# list of dict
DataFrame([
    {"Name":"Alice", "Scores":6},
    {"Name":"Bob", "Scores":7},
    {"Name":"Cindy", "Scores":8},
    {"Name":"Dan", "Scores":9}
])

    Name  Scores
0  Alice       6
1    Bob       7
2  Cindy       8
3    Dan       9

In [62]:
# renaming the rows
DataFrame([
    {"Name":"Alice", "Scores":6},
    {"Name":"Bob", "Scores":7},
    {"Name":"Cindy", "Scores":8},
    {"Name":"Dan", "Scores":9}
    ],
    index = ["A","B","C","D"]
)

    Name  Scores
A  Alice       6
B    Bob       7
C  Cindy       8
D    Dan       9

In [72]:
#data access
#series review
col1 = Series({"Alice":6, "Bob":7, "Cindy":8, "Dan":9})
col1

Alice    6
Bob      7
Cindy    8
Dan      9
dtype: int64

In [73]:
col1.loc["Bob"]

7

In [74]:
col1.iloc[2]

8

In [75]:
col1["Cindy"]

8

In [76]:
col1[1]

7

In [79]:
df = DataFrame([
    {"Name":"Alice", "Scores":6},
    {"Name":"Bob", "Scores":7},
    {"Name":"Cindy", "Scores":8},
    {"Name":"Dan", "Scores":9}
    ],
    index = ["A","B","C","D"]
)
df

    Name  Scores
A  Alice       6
B    Bob       7
C  Cindy       8
D    Dan       9

In [80]:
df.loc["A"]

Name      Alice
Scores        6
Name: A, dtype: object

In [82]:
type(df.loc["A"])

pandas.core.series.Series

In [83]:
df.iloc[1]

Name      Bob
Scores      7
Name: B, dtype: object

In [84]:
df.iloc[-1]

Name      Dan
Scores      9
Name: D, dtype: object

In [85]:
df["Name"]

A    Alice
B      Bob
C    Cindy
D      Dan
Name: Name, dtype: object

In [86]:
df["Scores"]

A    6
B    7
C    8
D    9
Name: Scores, dtype: int64

In [88]:
# df["A"]  # df.pos["A"] to get a row

In [90]:
df["Scores"].max()
df["Scores"].mean()

7.5

In [111]:
df

    Name  Scores
A  Alice       6
B    Bob      10
C  Cindy      10
D    Dan       9

In [112]:
df.loc["B","Name"]

'Bob'

In [113]:
df.loc["B","Scores"]

10

In [114]:
df.loc["B","Scores"] = 12

In [115]:
df

    Name  Scores
A  Alice       6
B    Bob      12
C  Cindy      10
D    Dan       9

In [116]:
df.loc["B","Scores"] += 3

In [117]:
df

    Name  Scores
A  Alice       6
B    Bob      15
C  Cindy      10
D    Dan       9

In [118]:
df.iloc[-1,0]

'Dan'

In [119]:
df.iloc[-1,1] += 2

In [120]:
df

    Name  Scores
A  Alice       6
B    Bob      15
C  Cindy      10
D    Dan      11

In [121]:
df.iloc[1:3, :]

    Name  Scores
B    Bob      15
C  Cindy      10

In [122]:
df.loc["B":"C", :]

    Name  Scores
B    Bob      15
C  Cindy      10

In [125]:
df.loc["B":"C", "Scores"] += 5

In [126]:
df

    Name  Scores
A  Alice       6
B    Bob      20
C  Cindy      15
D    Dan      11

In [128]:
df.loc[["B", "D"],"Name" ]

B    Bob
D    Dan
Name: Name, dtype: object

In [131]:
df.loc[["B", "D"],"Scores" ] += 2

In [132]:
df

    Name  Scores
A  Alice       6
B    Bob      22
C  Cindy      15
D    Dan      13

In [133]:
#Boolean Series
df["Scores"]

A     6
B    22
C    15
D    13
Name: Scores, dtype: int64

In [136]:
b = df["Scores"]>=15
b

A    False
B     True
C     True
D    False
Name: Scores, dtype: bool

In [137]:
df[b]

    Name  Scores
B    Bob      22
C  Cindy      15

In [189]:
df = pd.read_csv("IMDB-Movie-Data.csv")
#type(pd.read_csv("IMDB-Movie-Data.csv"))

In [166]:
df.head(2)
#df.tail(3)

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M

In [167]:
df["Year"]

0      2014
1      2012
2      2016
3      2016
4      2016
       ...
993    2015
994    2007
995    2008
996    2014
997    2016
Name: Year, Length: 998, dtype: int64

In [168]:
df["Rating"]

0      8.1
1      7.0
2      7.3
3      7.2
4      6.2
      ...
993    6.2
994    5.5
995    6.2
996    5.6
997    5.3
Name: Rating, Length: 998, dtype: float64

In [169]:
df.to_csv("movies2.csv")

In [171]:
pd.read_csv("movies2.csv")

,Unnamed: 0,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [172]:
df.to_csv("movies3.csv", index=False)

In [193]:
#What is the highest rated movie that had an above average runtime?
df["Runtime"]
df["Runtime"].mean()

113.17034068136273

In [196]:
b = df["Runtime"] > df["Runtime"].mean()
b

0       True
1       True
2       True
3      False
4       True
       ...
993    False
994    False
995    False
996    False
997    False
Name: Runtime, Length: 998, dtype: bool

In [199]:
long_movies = df[b]
long_movies

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M
...,...,...,...,...,...,...,...,...
977,The Skin I Live In,"Drama,Thriller",Pedro Almodóvar,"Antonio Banderas, Elena Anaya, Jan Cornet,Mari...",2011,120,7.6,3.19
979,Annie,"Comedy,Drama,Family",Will Gluck,"Quvenzhané Wallis, Cameron Diaz, Jamie Foxx, R...",2014,118,5.3,85.91
980,Across the Universe,"Drama,Fantasy,Musical",Julie Taymor,"Evan Rachel Wood, Jim Sturgess, Joe Anderson, ...",2007,133,7.4,24.34
987,Selma,"Biography,Drama,History",Ava DuVernay,"David Oyelowo, Carmen Ejogo, Tim Roth, Lorrain...",2014,128,7.5,52.07
989,Taare Zameen Par,"Drama,Family,Music",Aamir Khan,"Darsheel Safary, Aamir Khan, Tanay Chheda, Sac...",2007,165,8.5,1.2

In [201]:
long_movies["Rating"]
long_movies["Rating"].max()

9.0

In [204]:
b = long_movies["Rating"] == long_movies["Rating"].max()
b

0      False
1      False
2      False
4      False
6      False
       ...
977    False
979    False
980    False
987    False
989    False
Name: Rating, Length: 432, dtype: bool

In [205]:
long_movies[b]

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
54,The Dark Knight,"Action,Crime,Drama",Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,533.32

In [208]:
stats = df.describe()
stats

              Year     Runtime      Rating
count   998.000000  998.000000  998.000000
mean   2012.779559  113.170341    6.723447
std       3.207549   18.828877    0.945682
min    2006.000000   66.000000    1.900000
25%    2010.000000  100.000000    6.200000
50%    2014.000000  111.000000    6.800000
75%    2016.000000  123.000000    7.400000
max    2016.000000  191.000000    9.000000

In [209]:
stats.loc["50%", "Runtime"]

111.0